Repository: ALDamico/Chami
Catalog: ChamiUI/Localization/ChamiUIStrings.*.resx
Languages: it_it

# AboutBoxFirstLine_Content
source: Developed by Andrea Luciano Damico
it_it: Sviluppato da Andrea Luciano Damico

# LanguageSelectorLabel_Content
source: Language
it_it: Lingua

# StartingExecutionMessage
source: Starting execution...
it_it: Avvio dell'esecuzione...

# AboutBoxSecondLine_Content
source: Chami Icon by Vitaly Gorbachev
it_it: L'icona di Chami è di Vitaly Gorbachev

# AboutBoxLicense
source: Released under the terms of the MIT License
it_it: Pubblicato sotto i termini della licenza MIT

# AboutBoxFourthLine
source: Flag icons provided by Panayiotis Lipiridis (https://lipis.dev)
it_it: Icone delle bandiere fornite da Panayiotis Lipiridis (https://lipis.dev)

# ChamiAboutBox_Title
source: About Chami...
it_it: Informazioni su Chami...

# ChamiExportWindow_Title
source: Export environments
it_it: Esporta ambienti

# ExportWindowGroupBox_Header
source: Export settings:
it_it: Impostazioni di esportazione

# AllEnvironmentsRadioButton
source: All environments
it_it: Tutti gli ambienti

# SelectedEnvironmentsRadioButton_Content
source: Selected environments
it_it: Ambienti selezionati

# ExportDataButton_Content
source: Export
it_it: Esporta

# ExportWindowCancelButton_Content
source: Cancel
it_it: Annulla

# ExportWindowHeaderTitle
source: Export environments
it_it: Esporta ambienti

# EditEnvironmentMenuItem_Header
source: Edit
it_it: Modifica

# RenameEnvironmentMenuItem
source: Rename
it_it: Rinomina

# DeleteEnvironmentMenuItem_Header
source: Delete
it_it: Elimina

# CopyEnvironmentVariableMenuItem_Header
source: Copy
it_it: Copia

# DeleteEnvironmentVariableMenuItem_Header
source: Delete
it_it: Elimina

# NewEnvironmentMenuItem_Header
source: New Environment
it_it: Nuovo Ambiente

# SaveEnvironmentMenuItem_Header
source: Save
it_it: Salva

# ImportFromDotenvMenuItem_Header
source: From .env...
it_it: Da file .env...

# ImportMenuItem_Header
source: Import
it_it: Importa

# ImportFromJsonMenuItem_Header
source: From JSON...
it_it: Da file JSON...

# ExportMenuItem_Header
source: Export...
it_it: Esporta...

# QuitApplicationMenuItem_Header
source: Quit
it_it: Esci

# OptionsMenuItem_Header
source: Options
it_it: Opzioni

# ResetVarsMenuItem_Header
source: Reset environment variables
it_it: Reimposta le variabili di ambiente

# BackupEnvironmentMenuItem_Header
source: Backup current environment
it_it: Esegui il backup dell'ambiente corrente

# SettingsMenuItem_Header
source: Settings
it_it: Impostazioni

# AboutMenuItem_Header
source: About Chami...
it_it: Informazioni su Chami...

# WebsiteMenuItem_Header
source: Website
it_it: Sito web

# ApplyEnvironmentButton_Tooltip
source: Apply
it_it: Applica

# VariablesTabItem_Header
source: Variables
it_it: Variabili

# DataGridNameColumn_Header
source: Name
it_it: Nome

# DataGridValueColumn_Header
source: Value
it_it: Valore

# ExportWindowTitle
source: New Environment
it_it: Nuovo Ambiente

# NewEnvironmentWindowHeaderTitle
source: New environment
it_it: Nuovo ambiente

# NewEnvironmentDataGridNameColumn_Header
source: Name
it_it: Nome

# NewEnvironmentFormNameLabel_Content
source: Name
it_it: Nome

# NewEnvironmentDataGridValueColumn
source: Value
it_it: Valore

# NewEnvironmentWindowSaveButton_Content
source: Save
it_it: Salva

# NewEnvironmentWindowCancelButton_Content
source: Cancel
it_it: Annulla

# NewEnvironmentDataGridNameColumn
source: Name
it_it: Nome

# DataGridValueColumn
source: Value
it_it: Valore

# DataGridNameColumn
source: Name
it_it: Nome

# RenameEnvironmentWindowTitle
source: Rename environment
it_it: Rinomina ambiente

# RenameEnvironmentNameLabel_Content
source: Name
it_it: Nome

# RenameWindowCancelButton_Content
source: Cancel
it_it: Annulla

# SettingsWindowTitle_Title
source: Chami - Settings
it_it: Chami - Impostazioni

# ViewCategory
source: View
it_it: Visualizzazione

# DetectorCategory
source: Detector
it_it: Rilevatore

# SafetyCategory
source: Safety
it_it: Sicurezza

# LoggingCategory
source: Logging
it_it: Log

# LanguageCategory
source: Language
it_it: Lingua

# SettingsWindowCancelButton_Content
source: Cancel
it_it: Annulla

# SettingsWindowApplyButton_Content
source: Apply
it_it: Applica

# TaskbarItemShow_Header
source: Show Chami
it_it: Mostra Chami

# TaskbarItemHide
source: Hide Chami
it_it: Nascondi Chami

# TaskbarItemExit_Header
source: Exit
it_it: Esci

# ExistingEnvironmentMessageBoxText
source: An environment with the same name already exists!
it_it: Esiste già un ambiente con lo stesso nome!

# ExistingEnvironmentMessageBoxCaption
source: Error importing environment
it_it: Errore durante l'importazione dell'ambiente

# QuitMessageBoxText
source: Are you sure you want to quit?
it_it: Sei sicuro di voler uscire?

# QuitMessageBoxCaption
source: Exiting Chami.
it_it: Uscita da Chami.

# DetectorMessageBoxTextPart1
source: Chami has detected that the following applications are currently running:
it_it: Chami ha rilevato che le seguenti applicazioni sono in esecuzione:

# DetectorMessageBoxTextPart2
source: It is recommended that you restart them.
it_it: Si consiglia di riavviarle.

# DetectorMessageBoxCaption
source: Restart applications!
it_it: Riavvia le applicazioni!

# DeleteEnvironmentNoVariablesText
source: Are you sure you want to remove the environment {0}?
it_it: Sei sicuro di voler eliminare l'ambiente {0}?

# DeleteEnvironmentWithVariablesText
source: Are you sure you want to remove the environment {0} and its {1} variables?
it_it: Sei sicuro di voler eliminare l'ambiente {0} e le sue {1} variabili?

# DeleteEnvironmentCaption
source: Confirm deletion
it_it: Conferma la cancellazione

# JsonDeserializationErrorMessageBoxCaption
source: Deserialization error!
it_it: Errore di deserializzazione!

# JsonDeserializationErrorMessageBoxText
source: Unable to deserialize input file! See the log for more details.
it_it: Impossibile deserializzare il file di input! Consulta il log per maggiori dettagli.

# ResetEnvironmentMessageBoxText
source: This will remove the currently active Chami environment. Are you sure you want to proceed?
it_it: L'ambiente attualmente attivo verrà rimosso. Sei sicuro di voler continuare?

# ResetEnvironmentMessageBoxCaption
source: Confirm
it_it: Conferma

# UnableToInsertEnvironmentMessageBoxText
source: Unable to insert your new environment!
it_it: Impossibile inserire il nuovo ambiente!

# UnableToInsertEnvironmentMessageBoxCaption
source: Error!
it_it: Errore!

# GenericExceptionMessageBoxCaption
source: An exception occurred!
it_it: Si è verificata un'eccezione!

# RevertToOriginalEnvironmentMessage
source: Reverting back to original environment variables...
it_it: Ripristino delle variabili d'ambiente originali...

# RevertToOriginalEnvironmentNop
source: There's no active Chami environment! Nothing to do.
it_it: Non è attivo alcun ambiente di Chami! Niente da fare.

# ExecutionCompleteMessage
source: Execution complete
it_it: Esecuzione completata

# EnvironmentExportWindowViewModelDisplayedName
source: {0} ({1} variables)
it_it: {0} ({1} variabili)

# ExistingInstanceMessageBoxText
source: There's already another instance of Chami running with PID {0}. The application will now close.
it_it: Esiste un'altra istanza di Chami in esecuzione con PID {0}. L'applicazione verrà chiusa.

# ExistingInstanceMessageBoxCaption
source: Chami is already running!
it_it: Chami è già in esecuzione!

# EnvironmentNameValidationErrorMessage
source: You must specify an environment name!
it_it: Devi specificare il nome dell'ambiente!

# EnvironmentVariableNameNotNullErrorMessage
source: You must specify a name for the environment variable!
it_it: Devi specificare il nome della variabile di ambiente!

# EnvironmentVariableNameInvalidCharactersErrorMessage
source: The environment variable name contains invalid characters at positions {0}.
it_it: Il nome della variabile di ambiente contiene dei caratteri non validi alle posizioni {0}.

# EnvironmentVariableNameInvalidCharactersErrorMessageSingular
source: The environment variable name contains an invalid character at position {0}.
it_it: Il nome della variabile di ambiente contiene un carattere non valido alla posizione {0}.

# EnvironmentVariableNameLengthErrorMessage
source: An environment variable name has a maximum length of {0} characters. Current length: {1}
it_it: Il nome delle variabili di ambiente ha una lunghezza massima di {0} caratteri. Lunghezza corrente: {1}

# EnvironmentVariableNameNumberFirstCharacterErrorMessage
source: An environment variable name may not start with a digit.
it_it: Il nome di una variabile di ambiente non può cominciare con una cifra.

# EnvironmentVariableNameNotUniqueErrorMessage
source: There's already an environment variable with the name {0} in environment {1}.
it_it: Esiste già una variable di ambiente con nome {0} nell'ambiente {1}.

# ValidationFailedMessageBoxText
source: The variables in the environment you're trying to save didn't pass validation. Fix the issues and try saving again.
it_it: Le variabili dell'ambiente che stai cercando di salvare non hanno superato la validazione. Risolvi i problemi e riprova il salvataggio.

# ValidationFailedMessageBoxCaption
source: Validation error!
it_it: Errore di validazione!

# GithubLinkMenuItem_Header
source: Chami on Github
it_it: Chami su Github

# FindWindowSearchTextLabel_Content
source: Find
it_it: Trova

# FindWindowSearchButton_Content
source: Find next
it_it: Trova successivo

# FindWindowWhereToSearchLabel_Content
source: Search in:
it_it: Cerca in:

# FindWindowSearchInEnvironmentNameComboBoxItem_Content
source: In environments
it_it: Negli ambienti

# MainWindowEditMenuItem_Header
source: Edit
it_it: Modifica

# MainWindowFindMenuItem_Header
source: Find
it_it: Trova

# FindWindowWhereToSearchLabel
source: Search in:
it_it: Cerca in:

# ChamiFindWindow_Title
source: Find...
it_it: Trova...

# FindWindowSearchInEnvironmentVariablesComboBoxItem_Content
source: In environment variables
it_it: Nelle variabili di ambiente

# SortingOptionsMenuItem_Header
source: Sorting...
it_it: Ordinamento...

# SortByIdMenuItem_Header
source: By Id
it_it: Per Id

# SortByNameMenuItem_Header
source: By name
it_it: Per nome

# SortByDateMenuItem_Header
source: By date added
it_it: Per data di aggiunta

# SortDescendingMenuItem
source: Descending
it_it: Discendente

# MainWindowFilterLabel_Content
source: Filter
it_it: Filtro

# SortingGroupBox_Header
source: Sorting
it_it: Ordinamento

# SortByIdRadioButton_Content
source: By Id
it_it: Per Id

# AdvancedSortAndFilterOptionsExpander_Header
source: Sorting
it_it: Ordinamento

# AdvancedSortAndFilterOptionsExpander_Tooltip
source: Click to show advanced sorting options.
it_it: Fare clic per visualizzare le opzioni di ordinamento avanzate.

# SortByNameRadioButton_Content
source: By name
it_it: Per nome

# SortByDateAddedRadioButton_Content
source: By date added
it_it: Per data di aggiunta

# DescendingSortingCheckBox_Content
source: Descending
it_it: Discendente

# FilterTextbox_Watermark
source: Type to filter...
it_it: Digita per filtrare...

# FilterTextBoxWatermark_Content
source: Type to filter...
it_it: Digita per filtrare...

# EnvironmentNameFilterStrategyName
source: In environment name
it_it: Nel nome dell'ambiente

# ClearFilterButton_Tooltip
source: Clear filter
it_it: Cancella filtro

# FilteringAdvancedOptionsGroupBox_Header
source: Filter
it_it: Filtro

# FilteringStrategyLabel_Content
source: Find in:
it_it: Cerca in:

# FilteringCaseSensitivityLabel_Content
source: Case sensitive
it_it: Maiuscole/minuscole

# EnvironmentAndVariableNameFilterStrategyName
source: In environment and variable names
it_it: Nei nomi dell'ambiente e delle variabili

# EnvironmentAndVariableNameAndValueFilterStrategyName
source: In environment name and variable names and values
it_it: Nel nome dell'ambiente e nei nomi e nei valori delle variabili

# ImportEnvironmentWindowHeaderTitle_Content
source: Import environments
it_it: Importa ambienti

# ImportEnvironmentWindowTitle_Title
source: Import environments
it_it: Importa ambienti

# ImportEnvironmentWindowSaveButton_Content
source: Save
it_it: Salva

# DotEnvFileDialogDescription
source: dotEnv files
it_it: File dotEnv

# JsonFileDialogDescription
source: Json Files
it_it: File Json

# AllSupportedFilesFileDialogDescription
source: All supported formats
it_it: Tutti i formati supportati

# FeatureNotSupportedExceptionMessage
source: Feature not supported!
it_it: Funzionalità non supportata!

# EnvironmentReaderFactoryNotSupportedMessage
source: Conversion from format {0} is not supported.
it_it: La conversione dal formato {0} non è supportata.

# DetectAppplicationsGroupbox_Header
source: Detect applications
it_it: Rileva applicazioni

# DetectApplicationsCheckboxLabel_Content
source: Enable detecting the following applications are running
it_it: Abilita il rilevamento dell'esecuzione delle seguenti applicazioni

# AddApplicationButton_Content
source: Add
it_it: Aggiungi

# AppNameLabel_Content
source: App name
it_it: Nome app

# AddWatchedApplicationNullApplicationNameErrorMessage
source: Specify an application to watch for!
it_it: Occorre specificare un'applicazione da rilevare!

# FgColorLabel_Content
source: FgColor
it_it: Colore font

# FontSizeLabel_Content
source: Font size
it_it: Dim. carattere

# ExampleTextTextBox_Text
source: Example text...
it_it: Testo di esempio...

# BgColorLabel_Content
source: Bg Color
it_it: Colore sfondo

# FontLabel_Content
source: Font
it_it: Carattere

# ForegroundColorPicker_AvailableColorsHeader
source: Available colors
it_it: Colori disponibili

# ForegroundColorPicker_AdvancedTabHeader
source: Advanced
it_it: Avanzate

# BackgroundColorPicker_AvailableColorsHeader
source: Available colors
it_it: Colori disponibili

# BackgroundColorPicker_StandardColorsHeader
source: Standard colors
it_it: Colori standard

# BackgroundColorPicker_AdvancedTabHeader
source: Advanced
it_it: Avanzate

# LoggingGroupBox_Header
source: Logging
it_it: Log

# EnableLoggingLabel_Content
source: Enable logging
it_it: Abilita il log

# DisabledSafetyFeatureStackPanel_ToolTip
source: This feature is currently unavailable.
it_it: Questa caratteristica non è al momento disponibile.

# SafetyGroupbox_Header
source: Safety
it_it: Sicurezza

# EnableSafetyFeaturesLabel_Content
source: Enable safety features
it_it: Abilita le caratteristiche di sicurezza

# SafetyFeaturesVariablesLabel_Content
source: Variables
it_it: Variabili

# OperationCanceledMessage
source: An operation was cancelled!
it_it: L'operazione è stata annullata!

# OperationCanceledRevertMessage
source: Reverting back to previous environment.
it_it: Ripristino dell'ambiente precedente in corso.

# NewTemplateMenuItem_Header
source: New template
it_it: Nuovo template

# NewTemplateWindowTitle_Title
source: New template
it_it: Nuovo template

# NewTemplateWindowHeaderTitle_Content
source: New template
it_it: Nuovo template

# NewEnvironmentWindowTitle_Title
source: New environment
it_it: Nuovo ambiente

# FilteringCaseSensitivityIcon_ToolTip
source: Case sensitive
it_it: Maiuscole/minuscole

# MinimizationBehaviourControlLabel_Content
source: When minimized:
it_it: Quando ridotto a icona:

# MinimizeToTaskbarStrategyName
source: Minimize to Taskbar
it_it: Riduci nella barra delle applicazioni

# MinimizeToTrayStrategyName
source: Minimize to Tray
it_it: Riduci nell'area di notifica

# MinimizationCategory
source: Minimization
it_it: Riduzione a icona

# TaskbarShowChamiMenuItem_Header
source: Show Chami
it_it: Mostra Chami

# TaskbarHideChamiMenuItem_Header
source: Hide Chami
it_it: Nascondi Chami

# TaskbarExitMenuItem_Header
source: Exit
it_it: Esci

# DataGridMarkedForDeletionColumn
source: Delete?
it_it: Cancellare?

# DataGridMarkedForDeletionColumn_Header
source: Delete?
it_it: Cancellare?

# NewTemplateEnvironmentDataGridNameColumn
source: Name
it_it: Nome

# NewTemplateEnvironmentDataGridValueColumn
source: Value
it_it: Valore

# NewTemplateEnvironmentWindowCancelButton
source: Cancel
it_it: Annulla

# NewTemplateEnvironmentWindowSaveButton_Content
source: Save
it_it: Salva

# TemplateNameLabel_Content
source: Template name
it_it: Nome template

# TaskbarShowChamiMenuItem
source: Show Chami
it_it: Mostra Chami

# ApplicationsDetectedFirstParagraph_Text
source: Chami has detected that the following applications are currently running:
it_it: Chami ha rilevato che le seguenti applicazioni sono in esecuzione:

# ApplicationsDetectedSecondParagraph_Text
source: Chami can try and close those applications for you, or you could close them manually. Once done, click "Close".
it_it: Chami può provare a chiuderle automaticamente oppure puoi chiuderle manualmente. Una volta fatto, fai clic sul pulsante "Chiudi".

# RefreshButtonLabel_Content
source: Refresh
it_it: Aggiorna

# AllFilesRejectedCaption
source: All files were rejected!
it_it: Tutti i file sono stati rifiutati!

# AllFilesRejectedText
source: All the files you tried to import were rejected!
it_it: Tutti i file che hai cercato di importare sono stati rifiutati!

# TerminateAllButton_Content
source: Terminate all
it_it: Termina tutti

# CloseDetectedApplicationsWindowButton_Content
source: Close
it_it: Chiudi

# IsWatchEnabledColumn
source: Enabled?
it_it: Abilitato?

# ProcessNameColumn
source: Process name
it_it: Nome processo

# NewTemplateEnvironmentWindowCancelButton_Content
source: Cancel
it_it: Annulla

# TaskbarExitMenuItem
source: Exit
it_it: Esci

# TaskbarHideChamiMenuItem
source: Hide Chami
it_it: Nascondi Chami
